Revit 2024 API
WorksetId.InvalidWorksetId Property
 Get the invalid WorksetId whose IntegerValue is -1.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static WorksetId InvalidWorksetId { get; }
Visual Basic
Public Shared ReadOnly Property InvalidWorksetId As WorksetId
	Get
Visual C++
public:
static property WorksetId^ InvalidWorksetId {
	WorksetId^ get ();
}
See Also
WorksetId Class
Autodesk.Revit.DB Namespace